tutorials/multiphase/interFoam/les/nozzleFlow2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-06;

vertices
(
    (0 0 0)
    (3000 0 0)
    (0 100 -4.36609429085)
    (3000 300 -13.0982828726)
    (0 400 -17.4643771634)
    (3000 700 -30.562660036)
    (0 800 -34.9287543268)
    (3000 1000 -43.6609429085)
    (0 1600 -69.8575086536)
    (3000 1600 -69.8575086536)

    (0 100 4.36609429085)
    (3000 300 13.0982828726)
    (0 400 17.4643771634)
    (3000 700 30.562660036)
    (0 800 34.9287543268)
    (3000 1000 43.6609429085)
    (0 1600 69.8575086536)
    (3000 1600 69.8575086536)
);

blocks
(
    hex (0 1 3 2 0 1 11 10)
    (75 30 1)
    edgeGrading (1 1 1 1 0.1666667 1 1 0.1666667 1 1 1 1)

    hex (2 3 5 4 10 11 13 12)
    (75 40 1)
    edgeGrading (1 1 1 1 20 1 1 20 1 1 1 1)

    hex (4 5 7 6 12 13 15 14)
    (75 15 1)
    simpleGrading (1.0 1.0 1.0)

    hex (6 7 9 8 14 15 17 16)
    (75 15 1)
    simpleGrading (1.0 1.0 1.0)
);

edges
(
);

boundary
(
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 0 10 2)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (2 10 12 4)
            (4 12 14 6)
            (6 14 16 8)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 16 17 9)
            (7 9 17 15)
            (5 7 15 13)
            (3 5 13 11)
            (1 3 11 1)
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0 1 11 10)
            (10 11 13 12)
            (12 13 15 14)
            (14 15 17 16)
        );
    }

    back
    {
        type wedge;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (6 8 9 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
